Repository: CofficLab/Lumi
Catalog: Plugins/AgentRAGPlugin/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk, zh_tw

source: %lld days ago
zh_hans: %lld天前
zh_hk: %lld天前
zh_tw: %lld天前

source: %lld hours ago
zh_hans: %lld小时前
zh_hk: %lld小時前
zh_tw: %lld小時前

source: %lld minutes ago
zh_hans: %lld分钟前
zh_hk: %lld分鐘前
zh_tw: %lld分鐘前

source: Actions
zh_hans: 操作
zh_hk: 操作
zh_tw: 操作

source: All project indexes updated.
zh_hans: 全部项目索引更新完成。
zh_hk: 全部項目索引更新完成。
zh_tw: 全部專案索引更新完成。

source: Checking index status...
zh_hans: 正在检查索引状态...
zh_hk: 正在檢查索引狀態...
zh_tw: 正在檢查索引狀態...

source: Chunk Count
zh_hans: 片段数
zh_hk: 片段數
zh_tw: 片段數

source: Content
zh_hans: 内容
zh_hk: 內容
zh_tw: 內容

source: Current File
zh_hans: 当前文件
zh_hk: 當前檔案
zh_tw: 目前檔案

source: Document Chunks
zh_hans: 文档块
zh_hk: 文檔塊
zh_tw: 文件區塊

source: Embedding Model
zh_hans: 嵌入模型
zh_hk: 嵌入模型
zh_tw: 嵌入模型

source: Failed to get index status
zh_hans: 获取索引状态失败
zh_hk: 獲取索引狀態失敗
zh_tw: 取得索引狀態失敗

source: Failed to get status
zh_hans: 获取状态失败
zh_hk: 獲取狀態失敗
zh_tw: 取得狀態失敗

source: Failed to load index status: %@
zh_hans: 读取索引状态失败：%@
zh_hk: 讀取索引狀態失敗：%@
zh_tw: 讀取索引狀態失敗：%@

source: Failed to rebuild indexes: %@
zh_hans: 重建索引失败：%@
zh_hk: 重建索引失敗：%@
zh_tw: 重建索引失敗：%@

source: File Count
zh_hans: 文件数
zh_hk: 檔案數
zh_tw: 檔案數

source: Files
zh_hans: 文件
zh_hk: 檔案
zh_tw: 檔案

source: Index is outdated, recommend re-indexing
zh_hans: 索引已过期，建议重新索引
zh_hk: 索引已過期，建議重新索引
zh_tw: 索引已過期，建議重新索引

source: Index update completed: %@
zh_hans: 索引更新完成：%@
zh_hk: 索引更新完成：%@
zh_tw: 索引更新完成：%@

source: Indexed
zh_hans: 已索引
zh_hk: 已索引
zh_tw: 已索引

source: Indexing...
zh_hans: 正在索引...
zh_hk: 正在索引...
zh_tw: 正在索引...

source: Invalid project path
zh_hans: 无效的项目路径
zh_hk: 無效的項目路徑
zh_tw: 無效的專案路徑

source: Just now
zh_hans: 刚刚
zh_hk: 剛剛
zh_tw: 剛剛

source: Last Indexed
zh_hans: 最后索引
zh_hk: 最後索引
zh_tw: 最後索引

source: Loading…
zh_hans: 读取中…
zh_hk: 讀取中…
zh_tw: 讀取中…

source: Manage semantic indexes for tracked projects.
zh_hans: 管理已跟踪项目的语义索引。
zh_hk: 管理已追蹤項目的語義索引。
zh_tw: 管理已追蹤專案的語義索引。

source: No Projects
zh_hans: 暂无项目
zh_hk: 暫無項目
zh_tw: 暫無專案

source: Not indexed yet
zh_hans: 尚未建立索引
zh_hk: 尚未建立索引
zh_tw: 尚未建立索引

source: Outdated
zh_hans: 已过期
zh_hk: 已過期
zh_tw: 已過期

source: Please select or add a project first for RAG to build and display indexes.
zh_hans: 请先选择或添加项目，RAG 才能建立与展示索引。
zh_hk: 請先選擇或添加項目，RAG 才能建立與展示索引。
zh_tw: 請先選擇或新增專案，RAG 才能建立與展示索引。

source: Progress: %lld/%lld
zh_hans: 进度：%lld/%lld
zh_hk: 進度：%lld/%lld
zh_tw: 進度：%lld/%lld

source: Project
zh_hans: 项目
zh_hk: 專案
zh_tw: 專案

source: RAG Index Not Initialized
zh_hans: RAG 索引未初始化
zh_hk: RAG 索引未初始化
zh_tw: RAG 索引未初始化

source: RAG Index Status
zh_hans: RAG 索引状态
zh_hk: RAG 索引狀態
zh_tw: RAG 索引狀態

source: RAG database error: %@
zh_hans: RAG 数据库错误：%@
zh_hk: RAG 數據庫錯誤：%@
zh_tw: RAG 資料庫錯誤：%@

source: RAG internal state corrupted
zh_hans: RAG 内部状态异常
zh_hk: RAG 內部狀態異常
zh_tw: RAG 內部狀態異常

source: RAG service not initialized
zh_hans: RAG 服务未初始化
zh_hk: RAG 服務未初始化
zh_tw: RAG 服務未初始化

source: RAG service will initialize automatically when the plugin is enabled
zh_hans: RAG 服务将在插件启用时自动初始化
zh_hk: RAG 服務將在插件啟用時自動初始化
zh_tw: RAG 服務將在插件啟用時自動初始化

source: Rebuild
zh_hans: 重建
zh_hk: 重建
zh_tw: 重建

source: Rebuild All
zh_hans: 重建全部
zh_hk: 重建全部
zh_tw: 重建全部

source: Rebuild All Indexes
zh_hans: 重建全部索引
zh_hk: 重建全部索引
zh_tw: 重建全部索引

source: Rebuild failed: %@
zh_hans: 重建失败：%@
zh_hk: 重建失敗：%@
zh_tw: 重建失敗：%@

source: Rebuilding all indexes...
zh_hans: 正在重建全部索引...
zh_hk: 正在重建全部索引...
zh_tw: 正在重建全部索引...

source: Rebuilt: %@
zh_hans: 已重建：%@
zh_hk: 已重建：%@
zh_tw: 已重建：%@

source: Refresh
zh_hans: 刷新
zh_hk: 重新整理
zh_tw: 重新整理

source: Refresh All
zh_hans: 刷新全部
zh_hk: 重新整理全部
zh_tw: 重新整理全部

source: Refresh All Status
zh_hans: 刷新全部状态
zh_hk: 重新整理全部狀態
zh_tw: 重新整理全部狀態

source: Refresh failed: %@
zh_hans: 刷新失败：%@
zh_hk: 刷新失敗：%@
zh_tw: 重新整理失敗：%@

source: Refreshed: %@
zh_hans: 已刷新：%@
zh_hk: 已刷新：%@
zh_tw: 已重新整理：%@

source: Retrieval-Augmented Generation
zh_hans: 检索增强生成
zh_hk: 檢索增強生成
zh_tw: 檢索增強生成

source: Runtime
zh_hans: 运行时
zh_hk: 運行時
zh_tw: 執行時

source: Scanned
zh_hans: 已扫描
zh_hk: 已掃描
zh_tw: 已掃描

source: Search Code
zh_hans: 搜索代码
zh_hk: 搜索代碼
zh_tw: 搜尋程式碼

source: Search code snippets in the current project.
zh_hans: 在当前项目中搜索代码片段。
zh_hk: 在當前項目中搜索代碼片段。
zh_tw: 在目前專案中搜尋程式碼片段。

source: Skipped
zh_hans: 已跳过
zh_hk: 已跳過
zh_tw: 已跳過

source: Status
zh_hans: 状态
zh_hk: 狀態
zh_tw: 狀態

source: Up to Date
zh_hans: 最新
zh_hk: 最新
zh_tw: 最新

source: Vector Backend
zh_hans: 向量后端
zh_hk: 向量後端
zh_tw: 向量後端

source: Vector Dimensions
zh_hans: 向量维度
zh_hk: 向量維度
zh_tw: 向量維度

source: Vector acceleration unavailable
zh_hans: 向量加速不可用
zh_hk: 向量加速不可用
zh_tw: 向量加速無法使用

source: sqlite-vec extension did not load; semantic search falls back to slower in-memory scoring.
zh_hans: sqlite-vec 扩展未加载；语义搜索将回退到较慢的内存评分。
zh_hk: sqlite-vec 擴展未載入；語義搜尋將回退到較慢的記憶體評分。
zh_tw: sqlite-vec 擴充功能未載入；語義搜尋將退回至較慢的記憶體評分。
